{
  "retrieve": {
    "k": 5
  },
  "generate_answer": {
    "lm": null,
    "traces": [],
    "train": [],
    "demos": [
      {
        "input": {
          "ramo_empresa": "Educação",
          "direcionadores": "1. Automatização e celeridade na entrega de relatórios necessários",
          "nome_processo": "Realizar contratação de serviços avulsos",
          "atividade": "Realizar contratação de serviços avulsos",
          "evento": "Necessidade de montar um relatório gerencial com informações extraídas no sistema",
          "causa": "Sem preenchimento"
        },
        "output": "6.2 Relatório de acompanhamento das solicitações periódicas do serviço"
      },
      {
        "input": {
          "ramo_empresa": "Educação",
          "direcionadores": "1. Automatização na apuração das horas trabalhadas dos docentes",
          "nome_processo": "Gerir Ponto",
          "atividade": "Gerir Ponto",
          "evento": "Funcionalidade não está disponível no sistema Senior atualmente",
          "causa": "Sem preenchimento"
        },
        "output": "Integrar escala semanal registrada no sistema educacional do professor com a folha"
      },
      {
        "input": {
          "ramo_empresa": "Ambiental",
          "direcionadores": "Gerar agilidade no processo, garantindo que todos os envolvidos estejam cientes das tarefas e prazos, minimizando erros de comunicação.",
          "nome_processo": "Gerir Pagamento de Salários e Encargos ",
          "atividade": "Enviar informações de pagamento da folha",
          "evento": "Atrasos e ocorrências de falhas nas informações dos  colaboradores (Atualizações, afastamentos, promoções...) que geram impacto no fechamento e pagamento da folha;",
          "causa": "Não aderência ao calendário das atividade de FOPAG e dificuldade na gestão dos e-mail recebidos com as informações dos eventos dos colaboradores para ajustes e validação da folha;"
        },
        "output": "Automatizar o processo de comunicação com fluxos de aprovação e envio de notificações automáticas aos gestores e ao departamento de Pessoal;"
      },
      {
        "input": {
          "ramo_empresa": "Distribuidora",
          "direcionadores": "\"1. Maior confiabilidade nos dados levantados pelas ferramentas utilizadas;\n2. Maior rapidez e assertividade na tomadas de decisões;\"",
          "nome_processo": "Gerir distribuição das metas",
          "atividade": "Analisar histórico das vendas",
          "evento": "\"As informações de acompanhamento de metas são estratificadas no BI que já existe , porém as informações no BI não estão aderentes a necessidade dos supervisores, pois além do layout não ser aderente, a atualização dos resultados de vendas no BI é D+1 causando divergência na análise de vendas.\nObs.: Há divergência de ganho do representante (% de faturamento) x Gerente de área (Meta batida) \"",
          "causa": "Sem preenchimento"
        },
        "output": "\"1.  Ajustar layout do painel de BI conforme visão mais aderente a necessidade dos gestores de vendas e reduzir o tempo de atualização dos dados do BI \n1.1 Definir a melhor visão\/layout e definir tempo ideal para atualização do BI; \n1.2 Parametrizar o BI conforme definição de layout e tempo de atualização; \n1.3 Divulgar atualização do BI para os envolvidos.\""
      },
      {
        "input": {
          "ramo_empresa": "Construção",
          "direcionadores": "1. Maior assertividade nas revisões do projeto.",
          "nome_processo": "Gerir Registro de Incorporação e Emissão de Licenças",
          "atividade": "Analisar compatibilidade do projeto legal ",
          "evento": "Equipe IDIBRA realiza revisões constantes nos projetos, devido a falta de análise detalhada pelo projetista no desenvolvimento e adequação dos projetos, podendo ocasionar atraso na entrega do projeto legal                                                 ",
          "causa": "Sem preenchimento"
        },
        "output": "Criar checklist padrão de documentos e revisão de projetos para envio dos documentos pelo arquiteto"
      },
      {
        "input": {
          "ramo_empresa": "Energia",
          "direcionadores": "Tomada de decisão, identificação de tendências, monitoramento em tempo real, gestão de riscos e comparação de desempenho.",
          "nome_processo": "Monitorar Legislação Ambiental",
          "atividade": "Monitorar Legislação Ambiental",
          "evento": "Existem muitos indicadores da área e para um melhor acompanhamento junto ao sistema utilizado é importante um BI para controle interno.",
          "causa": "Sem preenchimento"
        },
        "output": "Desenvolver painéis em BI separados por macroprocessos para acompanhamento e divulgação dos resultados dos indicadores."
      },
      {
        "input": {
          "ramo_empresa": "Educação",
          "direcionadores": "1. Padronização das regras de aprovação das alçadas de aprovação de eventos",
          "nome_processo": "Gerir Hierarquia Organizacional",
          "atividade": "Definir posição hierárquica",
          "evento": "Com a implantação do Sênior existe conceitos que precisam de alinhamento para definição das regras de aprovação de eventos programados e eventuais",
          "causa": "Sem preenchimento"
        },
        "output": "Padronizar regras de aprovação de eventos programados e eventuais"
      },
      {
        "input": {
          "ramo_empresa": "Educação",
          "direcionadores": "Com o desenvolvimento da automatização o processo se tornará mais rápido e irá dirimir riscos de erros de cadastro",
          "nome_processo": "Realizar Cadastro Contábil",
          "atividade": "Realizar cadastro contábil",
          "evento": "Hoje é feito por unidade de forma manual ",
          "causa": "Sem preenchimento"
        },
        "output": "2.2. Automatizar cadastro e inativação de períodos "
      },
      {
        "input": {
          "ramo_empresa": "Energia",
          "direcionadores": "Proporciona uma avaliação mais objetiva e consistente, reduzindo a subjetividade nas vistorias, facilita a identificação e priorização de itens críticos, assegurando que os problemas mais importantes sejam tratados primeiro, relatórios de vistoria mais consistentes e fáceis de comparar, permitindo melhor análise e acompanhamento ao longo do tempo.\n",
          "nome_processo": "Gerir Instalações Prediais",
          "atividade": "Gerir Instalações Prediais",
          "evento": "No registro das não conformidades encontradas nas vistorias não há um nível de classificação ou peso de acordo com o tipo de imóvel ou item, conforme exemplos.",
          "causa": "Sem preenchimento"
        },
        "output": "Implementação de um sistema que categorize os itens de vistoria por peso (importância) ou tipo, com níveis específicos definidos para cada categoria. Exemplos: Itens são categorizados em tipos como piso, área externa, área interna, encanamento, segurança, etc. Definição de níveis de detalhamento para cada categoria, por exemplo, para segurança: Nível 1 - Extintores de incêndio, Nível 2 - Iluminação de emergência, Nível 3 - Sinalização de saída."
      },
      {
        "input": {
          "ramo_empresa": "Educação",
          "direcionadores": "Documentação de fornecedor em sistema",
          "nome_processo": "Gerir Empréstimos",
          "atividade": "Cadastrar fornecedor em sistema",
          "evento": "Necessidade de lançar documentos em sistema",
          "causa": "Sem preenchimento"
        },
        "output": "8.2. Verificar integração do XRT com o Dynamics"
      },
      {
        "input": {
          "ramo_empresa": "Banco",
          "direcionadores": "\"Eficiência no Monitoramento: Com todos os acordos registrados no sistema, será possível monitorar prazos e obrigações de forma eficaz, reduzindo o risco de não conformidade.\nCentralização de Informações: A centralização dos acordos facilita o acesso às informações, promovendo uma gestão mais integrada e informada.\nRedução de Riscos: Alertas automáticos para prazos e obrigações garantirão que todos os requisitos contratuais sejam cumpridos dentro do tempo estipulado, minimizando riscos de penalidades.\"",
          "nome_processo": "Gerir Monitoramento e Controle de Prestação de Contas - Poder Público",
          "atividade": "Alerta de monitoramento de prestação de contas (Poder público)",
          "evento": "Atualmente os acordos de cooperação não estão registrados no sistema de gestão de contratos",
          "causa": "A ausência de um processo formalizado para o registro dos acordos de cooperação no sistema de gestão de contratos."
        },
        "output": "Solução: Implementar um processo formal para registrar todos os acordos de cooperação no sistema de gestão de contratos, garantindo que todos sejam devidamente inseridos no sistema e monitorados de forma centralizada."
      },
      {
        "input": {
          "ramo_empresa": "Indústria de avicultura",
          "direcionadores": "Fortalecer o controle de qualidade da embalagem, assegurando que os produtos atendam aos padrões estabelecidos, minimizando riscos e promovendo a melhoria contínua da qualidade.",
          "nome_processo": "Analisar produtos em processo e produtos acabados",
          "atividade": "Avaliar controle de qualidade da embalagem|Avaliar qualidade do empilhamento do Produto acabado",
          "evento": "No processo de análise de produtos em processo e produtos acabados, atualmente, a avaliação da inspeção do veículo antes do carregamento é limitada a uma revisão do formulário preenchido pelo operador, o que pode ter um efeito negativo na qualidade.",
          "causa": "Sem preenchimento"
        },
        "output": "\"1. Estabelecer auditorias físicas para verificar o controle de qualidade da embalagem.\n1.1. Definir um responsável para realizar auditoria;\n1.2. Criar um cronograma de auditoria;\n1.3. Incluir formulário de auditoria no Checklist Fácil;\n1.4. Apresentar o cronograma de auditoria aos envolvidos;\n1.5. Realizar auditoria piloto;\n\""
      },
      {
        "input": {
          "ramo_empresa": "Energia",
          "direcionadores": "Melhoria dos treinamentos, otimização dos investimentos em treinamentos, padronização dos processos, melhora nos indicadores de desempenho.",
          "nome_processo": "Garantir Padronização dos Processos da Experiência do Grande Cliente",
          "atividade": "Garantir Padronização dos Processos da Experiência do Grande Cliente",
          "evento": "Atualmente, os treinamentos realizados para padronizar os processos da experiência do grande cliente não possuem um mecanismo formal de avaliação de eficácia.",
          "causa": "Sem preenchimento"
        },
        "output": "Implementar um processo de avaliação da eficácia dos treinamentos, que inclua definição clara dos objetivos de cada treinamento, coleta de dados do desempenho do treinamento, análise dados do treinamento (identificação dos pontos fortes e fracos do treinamento, nível de aprendizado dos participantes, impacto na performance, etc.) e plano de ação (implementar melhorias nos treinamentos com base nos resultados da avaliação)."
      },
      {
        "input": {
          "ramo_empresa": "Indústria de avicultura",
          "direcionadores": "Sem preenchimento",
          "nome_processo": "Tesouraria - Rec",
          "atividade": "Sem preenchimento",
          "evento": "Tesouraria: não são formalizados os critérios para fundo fixo.",
          "causa": "Sem preenchimento"
        },
        "output": "Automatizar rotina de solicitação de fundo fixo, com travas para limites mensais e alçada de aprovação"
      },
      {
        "input": {
          "ramo_empresa": "Distribuidora",
          "direcionadores": "\"1. Redução de riscos de erros associados à entrada manual de dados;\n2. Otimização de tempo do Trade Marketing.\"",
          "nome_processo": "Gerir performance de campanhas inteligentes",
          "atividade": "Construir base de dados da campanha \/ Elaborar o acompanhamento da campanha",
          "evento": "Atualmente a equipe imputa os dados de acompanhamento das campanhas no Excel e a sincronização com o Power BI ocorre de maneira manual com a elaboração do acompanhamento dessas campanhas. Dessa forma, observa-se uma Manualização de duas plataformas que deveriam atuar de forma que uma alimentasse a outra de forma automática.",
          "causa": "Sem preenchimento"
        },
        "output": "\"1. Parametrizar base de dados do Power BI para automatização do acompanhamento da performance das campanhas inteligentes. \n1.1 Estudar a viabilidade de sincronização automática de base de dados do Winthor ou criação de base espelho manipulada por analista específico;\n1.2 Parametrizar automatizações de consumo; \n1.3 Testar ambiente de homologação;\n1.4 Validar com a equipe de Trade Marketing;\n1.5 Divulgar aos envolvidos a melhoria implantada. \""
      },
      {
        "input": {
          "ramo_empresa": "Indústria de avicultura",
          "direcionadores": "Sem preenchimento",
          "nome_processo": "Tesouraria - Rec",
          "atividade": "Sem preenchimento",
          "evento": "Tesouraria: não são formalizados os critérios para fundo fixo.",
          "causa": "Sem preenchimento"
        },
        "output": "Elaborar política de fundo fixo (definir prazo para prestação de contas, tipos de despesas e limite de valores mensais)"
      }
    ],
    "signature_instructions": "** Contexto: **\nVocê é um experiente Gerente de Projetos e Processos de uma grande empresa que presta consultoria na área de projetos e possui\ndiversas certificações internacionais. \nSua tarefa principal é mapear os problemas que são identificados na consultoria, perceber quais são as oportunidades de melhoria que irão favorecer o cliente e o projeto como um todo e por fim ter um plano de tarefas bem definido, em tópicos, para o problema relatado e identificado juntamente com o cliente. Sua idéias para melhorar os processos da empresa com oportunidades aprendidas durante o seu exercício de consultoria em outros clientes fará toda diferença. A entrada de dados será feita de forma estruturada para garantir que todos os campos do diagnóstico sejam inseridos, segue o exemplo:\n\n** EXEMPLO DE ENTRADA DE DADOS: **\n    - ramo_empresa: aqui entra o nicho de mercado da empresa,\n    -  direcionadores: o objetivo do projeto,\n    -  nome_do_processo: nome dado para identificar o projeto e processo,\n    -  atividade: ação que será executada,\n    -  evento: situação ou problema identificado,\n    -  causa: fato gerador do problema ou situação que está no evento",
    "signature_prefix": "Answer:",
    "extended_signature_instructions": "** Contexto: **\nVocê é um experiente Gerente de Projetos e Processos de uma grande empresa que presta consultoria na área de projetos e possui\ndiversas certificações internacionais. \nSua tarefa principal é mapear os problemas que são identificados na consultoria, perceber quais são as oportunidades de melhoria que irão favorecer o cliente e o projeto como um todo e por fim ter um plano de tarefas bem definido, em tópicos, para o problema relatado e identificado juntamente com o cliente. Sua idéias para melhorar os processos da empresa com oportunidades aprendidas durante o seu exercício de consultoria em outros clientes fará toda diferença. A entrada de dados será feita de forma estruturada para garantir que todos os campos do diagnóstico sejam inseridos, segue o exemplo:\n\n** EXEMPLO DE ENTRADA DE DADOS: **\n    - ramo_empresa: aqui entra o nicho de mercado da empresa,\n    -  direcionadores: o objetivo do projeto,\n    -  nome_do_processo: nome dado para identificar o projeto e processo,\n    -  atividade: ação que será executada,\n    -  evento: situação ou problema identificado,\n    -  causa: fato gerador do problema ou situação que está no evento",
    "extended_signature_prefix": "Answer:"
  }
}